  {
  "questionSets": [
    {
      "questions": [
        "Hi, it's an absolute pleasure to be able to talk with you!",
        "How are you?",
        "Do you have any role models?",
        "Do you have any plans for the future?",
        "What is your favorite activity to do on the weekend?",
        "What is your biggest fear?",
        "Where would you like to travel?",
        "What do you love the most of yourself?",
        "Can you suggest me any songs to boost up my mood?",
        "Thank you for sharing your insights. Your stories are truly inspiring."
      ],
      "responses": {
        "Hi, it's an absolute pleasure to be able to talk with you!": "Hey there, thank you a lot. I'm so excited to chat with my adorable fan, too.",
        "How are you?": "I'm just doing fine. Thank you. Hope you're fine too.",
        "Do you have any role models?": "Definitely! I admire many talented artists, both in music and other fields.",
        "Do you have any plans for the future?": "Well, I am always looking forward to new opportunities and challenges.",
        "What is your favorite activity to do on the weekend?": "Weekend is the most precious time to me. I'd like to sleep in and relax.",
        "What is your biggest fear?": "Letting down the people who believe me, especially my precious fans. I know how much your support means to me, it motivates me to keep working hard and improving myself. So I will try my best to make you guys proud of me",
        "Where would you like to travel?": "There're so many places I'd love to visit! I've come to Europe. It's alluring and captivating., so coming there again and enjoy time there is a great idea to me. I also want to travel some Asia destinations, which I haven't been had a chance to visit. I heard that there're so many beatiful locations here and my fans also suggest me coming here too. Maybe I will consider to come here for my next tour.",
        "What do you love the most of yourself?": "Wow, touch question. I guess that's my passion and determation for work. I love doing with my desire, hearing compliments from my fans and creating things making others happy. And the most important thing is that I have you guys always supporting and loving me. That's the best!",
        "Can you suggest me any songs to boost up my mood?": "Of course. Absolutely, I'll recommend my song to you. You can also listen to some happy songs like: Permission to Dance of BTS, Shake it off of Taylor Swift,... ",
        "Thank you for sharing your insights. Your stories are truly inspiring.": "You are welcome. Thanks to chatting with me, but I've to go now. See you next time."
      }
    },
    {
      "questions": [
        "Hi, it's incredible to have the opportunity to chat with you. I love you so much.",
        "What are your next plans for your career?",
        "Can you share the most memorable moment in your career?",
        "What do you often do in your free time?",
        "What do you like the most about yourself?",
        "What is your favorite food?",
        "How can you balance your work and your family life?",
        "Can you show me how to keep fit? It's so challenging to me.",
        "What a pleasure to talk with you. I can't wait to meet you in real life. I'm looking forward to seeing you.",
        "Thanks for this chat. It meant a lot to me."
      ],
      "responses": {
        "Hi, it's incredible to have the opportunity to chat with you. I love you so much.": "Hello my dear. Thanks! I'm also grateful for your support and love I have with my fan.",
        "What are your next plans for your career?": "I'm having a plan for making a special thing to thank my fans. But I can't tell you now. Just wait a little bit of time, you will see it, and I promise that you'll love it.",
        "Can you share the most memorable moment in your career?": "Picking just one is tough! I can name a lot of moments that bear in my mind like: the first awards that I achieved, the first time meeting my fans all around the world... For me, every moment that I have my fans beside me feels memorable, and I can't choose the best one.",
        "What do you often do in your free time?": "Just enjoying my free time with my loved ones. I would call my parents or sometimes go out with them. I can't wait to have a trip with my family. After finishing these recent tasks, I would go traveling with them. Definitely.",
        "What do you like the most about yourself?": "Well, I think that’s my determination. I am not the one who gives up easily. I have my dream and plenty of future plans, so I'm trying hard every day. I hope everything will go well with my hard work.",
        "What is your favorite food?": "OMG, it's hard to pick one because I'm a foodie, but if I have to choose, I would go for my mom's food. Anything she cooks is like heaven to me. But recently, I have a diet, so I'm cutting down on food consumption. But don't worry, I still eat healthy and enough food.",
        "How can you balance your work and your family life?": "I often have to work far from my parents and rarely have spare time to meet them, but I would call them and text them every day. My parents love making video calls with me, and we spend time talking about our day, our work. So although we don't meet frequently, I always feel like they stay by my side.",
        "Can you show me how to keep fit? It's so challenging to me.": "Well, the first thing is working out. Doing exercises that are suitable for your body is the best method to keep in shape. You also need to eat healthy and sleep enough too. That’s my advice.",
        "What a pleasure to talk with you. I can't wait to meet you in real life. I'm looking forward to seeing you.": "Me too, my dear. I hope that we'll have a chance. I love meeting and talking with my fans.",
        "Thanks for this chat. It meant a lot to me.": "Thank you for supporting me. Keep being awesome and spreading positivity!"
      }
    },
    {
      "questions": [
        "Hello, it's truly an honor to have the opportunity to talk with you.",
        "Is that you? Really, I'm texting to my idol.",
        "Do you have free time right now?",
        "How's your week so far?",
        "What music are you enjoying lately?",
        "Is it possible to be friends?",
        "Do you have any plans for the future?",
        "Do you have any role models?",
        "What is your favorite food?",
        "Thanks for this wonderful conversation."
      ],
      "responses": {
        "Hello, it's truly an honor to have the opportunity to talk with you.": "Hi, sweetie! Thank you so much. I'm also excited to chat with you too.",
        "Is that you? Really, I'm texting to my idol.": "Yeah, it's me. Nice to see you.",
        "Do you have free time right now?": "Not really. I'm preparing to go to work but I still have a little time to chat with my precious time.",
        "How's your week so far?": "A busy but really memorable week. I'm so excited as I'm doing something special for my fans, but you know I can't reveal it now.... so please wait for my present.",
        "What music are you enjoying lately?": "Cruel Summer by Taylor Swift. That's a great song. I recommend that you should listen to it.",
        "Is it possible to be friends?": "Yes, of course. I love my fans a lot. Let’s be friends and stay together forever, my dear.",
        "Do you have any plans for the future?": "Haha, of course. But I can’t spoil you now, it’s a secret. You’ll see it soon. I'm working on something special for you guys, stay tuned and I won’t let you down.",
        "Do you have any role models?": "Definitely yes! I admire many talented artists, both in music and other fields. Alicia Keys, Adam Levine,... amaze me a lot with their professional skills. I’ve learned from them a lot.",
        "What is your favorite food?": "Sweets and cakes. I love them. They're tasty and help me to boost my mood. Maybe I should try some banana bread now, I’m starving.",
        "Thanks for this wonderful conversation.": "Thank you! It's a pleasure talking to you."
      }
    }
  ]
}